<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 11 changes.</summary>

```diff
# module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
+ time_rotating.rotate_tailnet_key will be created
! module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm is tainted, so must be replaced
+ module.debian12.proxmox_virtual_environment_vm.vm_template will be created
+ module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be created
- module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config will be destroyed
# (because proxmox_virtual_environment_file.cloud_config is not in configuration)
- module.ubuntu_dev_vm.random_password.ubuntu_vm_password will be destroyed
# (because random_password.ubuntu_vm_password is not in configuration)
- module.ubuntu_dev_vm.random_pet.ubuntu_pet will be destroyed
# (because random_pet.ubuntu_pet is not in configuration)
- module.ubuntu_dev_vm.tls_private_key.ubuntu_vm_key will be destroyed
# (because tls_private_key.ubuntu_vm_key is not in configuration)
+ module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
+ module.debian12.module.cloud_image.proxmox_virtual_environment_download_file.image will be created
+ module.ubuntu22.module.cloud_image.proxmox_virtual_environment_download_file.image will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 7 to add, 0 to change, 5 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-08T16:19:25Z [(view log)](https://github.com/perchnet/p/actions/runs/16835258527/job/47693048943#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
  ~ resource "proxmox_virtual_environment_vm" "coreos_vm" {
        id                      = "131"
      + ipv4_addresses          = []
      + ipv6_addresses          = []
      + mac_addresses           = [
          + "BC:24:11:80:D2:6A",
        ]
        name                    = "tf-coreos-periphery-E1o"
      + network_interface_names = []
        tags                    = [
            "terraform",
        ]
        # (25 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # time_rotating.rotate_tailnet_key will be created
  + resource "time_rotating" "rotate_tailnet_key" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_minutes = 60
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:80:D2:6A",
        ] -> (known after apply)
        name                    = "tf-coreos-periphery-E1o"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = "zssd-files:iso/TFimg_fedora-coreos-42-5160.20250803.2.0-proxmoxve.x86_64.qcow2.xz.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
            # (2 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:80:D2:6A" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.debian12.proxmox_virtual_environment_vm.vm_template will be created
  + resource "proxmox_virtual_environment_vm" "vm_template" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "debian12"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "template",
          + "debian",
        ]
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 9012

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = "raw"
          + file_id           = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = "nocloud"
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device (known after apply)

      + vga (known after apply)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be created
  + resource "proxmox_virtual_environment_vm" "vm_template" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "ubuntu22"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "template",
          + "ubuntu",
        ]
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 8022

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = "raw"
          + file_id           = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = "nocloud"
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device (known after apply)

      + vga (known after apply)
    }

  # module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config will be destroyed
  # (because proxmox_virtual_environment_file.cloud_config is not in configuration)
  - resource "proxmox_virtual_environment_file" "cloud_config" {
      - content_type   = "snippets" -> null
      - datastore_id   = "snippets" -> null
      - file_name      = "example.cloud-config.yaml" -> null
      - id             = "snippets:snippets/example.cloud-config.yaml" -> null
      - node_name      = "pve1" -> null
      - overwrite      = true -> null
      - timeout_upload = 1800 -> null

      - source_raw {
          - data      = (sensitive value) -> null
          - file_name = "example.cloud-config.yaml" -> null
          - resize    = 0 -> null
        }
    }

  # module.ubuntu_dev_vm.random_password.ubuntu_vm_password will be destroyed
  # (because random_password.ubuntu_vm_password is not in configuration)
  - resource "random_password" "ubuntu_vm_password" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - length           = 16 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "_%@" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

  # module.ubuntu_dev_vm.random_pet.ubuntu_pet will be destroyed
  # (because random_pet.ubuntu_pet is not in configuration)
  - resource "random_pet" "ubuntu_pet" {
      - id        = "normal-cardinal" -> null
      - keepers   = {
          - "ssh_public_key" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEyhYKsPcfOeY139vtFE5E5KTsdtAboxZD8jRvy2VpBA
            EOT
        } -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

  # module.ubuntu_dev_vm.tls_private_key.ubuntu_vm_key will be destroyed
  # (because tls_private_key.ubuntu_vm_key is not in configuration)
  - resource "tls_private_key" "ubuntu_vm_key" {
      - algorithm                     = "ED25519" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "b10a8423002c1aae736ba263ef5a767ab6d30d13" -> null
      - private_key_openssh           = (sensitive value) -> null
      - private_key_pem               = (sensitive value) -> null
      - private_key_pem_pkcs8         = (sensitive value) -> null
      - public_key_fingerprint_md5    = "3a:79:15:68:90:ef:c6:6c:5d:45:25:b8:e2:24:be:58" -> null
      - public_key_fingerprint_sha256 = "SHA256:oQKAo7wkUHUfgTcuZsCCsF8yBVqWrZoE8FXlfU40a1Q" -> null
      - public_key_openssh            = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEyhYKsPcfOeY139vtFE5E5KTsdtAboxZD8jRvy2VpBA
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MCowBQYDK2VwAyEATKFgqw9x855jXf2+0UTkTkpOx20BujFkPyNG/LZWkEA=
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 2048 -> null
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "vm-example-minimal"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = false
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 100

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = 8022
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + dns {
              + servers = []
            }

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys = [
                  + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                ]
            }
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.debian12.module.cloud_image.proxmox_virtual_environment_download_file.image will be created
  + resource "proxmox_virtual_environment_download_file" "image" {
      + checksum            = "a7dfe434afc40afb0a791c777f3edba6b1a5c4b7315a61073fe5e34752d3bc5fd44ff67ef054eb4263687a97f7ce4896bf5bad5f216ef8b9d4a84541759e743d"
      + checksum_algorithm  = "sha512"
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "debian-12-generic-amd64.img"
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud.debian.org/images/cloud/trixie/20250806-2196/debian-13-generic-amd64-20250806-2196.qcow2"
      + verify              = true
    }

  # module.ubuntu22.module.cloud_image.proxmox_virtual_environment_download_file.image will be created
  + resource "proxmox_virtual_environment_download_file" "image" {
      + checksum            = "7eb9f1480956af75359130cd41ba24419d6fd88d3af990ea9abe97c2f9459fda"
      + checksum_algorithm  = "sha256"
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/releases/22.04/release-20240207/ubuntu-22.04-server-cloudimg-amd64.img"
      + verify              = true
    }

Plan: 7 to add, 0 to change, 5 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-39-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->